{"about.about_me":"OVER MIJ","about.about_me_text":"Ik heb een passie voor het maken van hoge kwaliteit Laravel applicaties die schaalbaar / onderhoudbaar zijn, die complexe business problemen oplossen en fijn zijn voor de gebruiker, dus hun leven te verbeteren.","about.connect":"Get In Touch","about.connect_text":"Als je een interessant idee of project hebt wat je wil laten ontwikkelen met Laravel en Vue.js, voel je vrij om mij te benaderen via het contact formulier, via social media of via mijn persoonlijke contact informatie.","about.solving_problems":"Problemen oplossen met hoge kwaliteit software","approach.how_i_work":"Hoe ga ik te werk?","approach.my_approach":"Mijn Aanpak","approach.requirements":"Requirements","approach.requirements_text":"Ik zorg dat het duidelijk is wat er gemaakt moet worden, voordat ik een regel code schrijf","approach.tests":"Testen","approach.tests_text":"Door eerst tests te schrijven zorg ik ervoor dat de requirements gedekt zijn als de tests slagen","approach.development":"Ontwikkeling","approach.development_text":"Met software design patronen zorg ik ervoor dat mijn software schaalbaar en onderhoudbaar is","approach.user_interface":"User Interface","approach.user_interface_text":"Indien nodig maak ik een visueel aantrekkelijke, dynamische en responsieve UI","case_study.heading_text":"Op deze pagina laat ik stap voor stap zien hoe ik een project aanpak.","case_study.title":"Genereren inkoopbestellingen","case_study.date":"Datum","case_study.location":"Locatie","case_study.date_value":"Augustus","case_study.text_section_1":"Het doel van deze applicatie is automatisch inkoopbestellingen te genereren op basis van de huidige voorraad. Deze inkoopbestellingen worden geexporteerd en daarna gemaild.","case_study.text_section_2":"Verder moet dit op bepaalde tijdstippen en dagen gebeuren: bestelmomenten van de leverancier. Iedere dag plant de applicatie taken in die een potentiele inkoopbestelling genereren.","case_study.text_section_3":"Allereerst begin ik met het vergaren van de requirements samen met de klant. Hieruit volgen verschillende features die ik in Azure DevOps beschrijf. De requirements voor dit project waren als volgt.","case_study.requirement_1":"Product groepen worden onderscheiden door middel van een tag in Picqer","case_study.requirement_2":"Als (vrije voorraad + vul voorraad aan tot niveau) < bestelniveau dan moet er besteld worden: vul voorraad aan tot niveau - vrije voorraad - te ontvangen","case_study.requirement_3":"Het inkoop advies houdt rekening met minimale bestelhoeveelheid en bestel in veelvoud van","case_study.requirement_4":"Er wordt rekening gehouden met minimaal bestelbedrag leverancier","case_study.requirement_5":"Per leverancier een ander export bestand welke gemaild wordt naar de klant","case_study.requirement_6":"Leverancier kan 0, 1 of meerdere bestelmomenten per dag hebben","case_study.requirement_7":"Iedere minuut wordt gekeken of een inkoop order gegenereerd moet worden","case_study.requirement_8":"Gemiste bestelmomenten van voorgande dagen worden niet ingehaald","clients.happy_clients":"Een aantal van mijn blije klanten","clients.happy_clients_text":"Klanten waar ik in het verleden mee heb gewerkt of nog steeds mee samenwerk","contact.contact_me":"Contacteer mij","contact.project":"Heb je een project in gedachte?","contact.project_text":"Als je me wilt inhuren voor je project, voel je vrij mij te contacteren via dit contact formulier. Je kan me ook bereiken via email, telefoon nummer of social media","contact.name":"Voer je naam in","contact.company":"Bedrijf (Optioneel)","contact.email":"Voer je email adres in","contact.phone":"Telefoonnummer","contact.enter_project":"Vertel me over je project","contact.contact_me_2":"Contacteer Mij","footer.lets_talk":"Laten we praten!","footer.info":"Contact Informatie","footer.netherlands":"Nederland","header.home":"Home","header.about_me":"Over Mij","header.skills":"Skills","header.portfolio":"Portfolio","header.approach":"Mijn Aanpak","header.contact":"Contact","home.e_commerce":"E-commerce web applicaties.","home.hi":"Hi! Ik ben","home.freelance":"ZZP","home.i_am":"Laravel en Vue.js ontwikkelaar","home.headline":"Op maat gemaakte en robuuste web applicaties om jouw bedrijfsprocessen te optimaliseren","home.contact":"Contact","home.learn_more":"Meer Informatie","portfolio.recent_projects":"Recente Projecten","portfolio.recent_projects_text":"Mijn meest recente projecten heb ik hieronder toegelicht","resume.education":"Opleiding & Ervaring","resume.resume":"Mijn CV","resume.resume_text":"Na het afronden van mijn master aan de TU Delft ben ik begonnen als ZZPer web ontwikkelaar","resume.laravel_and_vuejs":"ZZPer Laravel & Vue.js Ontwikkelaar","resume.laravel_and_vuejs_text":"De afgelopen 2 jaar ben ik als freelancer aan het werk bij Home Design Shops voor 3 dagen in de week. Ik ontwikkel een breed scala aan web applicaties voor hen in Laravel, gefocust op het automatiseren van bedrijfsprocessen.","resume.freelance_laravel_and_vuejs":"ZZPer Laravel & Vue.js Ontwikkelaar","resume.freelance_laravel_and_vuejs_text":"Naast Home Design Shops werk ik aan andere projecten als ZZPer, zoals web applicaties (Laravel en Wordpress) en embedded software (Arduino, Python / ROS)","resume.now":"nu","resume.graduate_msc":"Afstudeer (MSc.) Stagiair Robotica Software Ontwikkelaar","resume.graduate_msc_text_1":"Ik heb mijn ","resume.graduate_msc_text_thesis":"master thesis","resume.graduate_msc_text_2":" voor de TU Delft gedaan bij Heemskerk Innovative Technology, wat ging over het toepassen van machine learning om een robot pick-and-placen te leren. Het hele systeem was gebouwd met Python, C++ en ROS.","resume.intern_robotics":"Stagiair Robotic Software Developer","resume.intern_robotics_text":"In mijn stage heb ik bijgedragen aan het ontwikkelen van een autonome pick-and-place pipeline for een zorg robot, gebouw met Python, C++ en ROS.","resume.bachelor_text":"Ik heb mijn BSc. in Werktuigbouwkunde afgerond met een eindproject waarbij ik een iMicroFluidic pipet heb ontwikkeld. Dit was een mechatronisch system geregeld met een Arduino en een Android app, welke druppels kon pipetteren in order grootte microliters.","skills.offer":"Wat heb ik te bieden?","skills.my_skills":"Mijn Skills","skills.advanced":"Geavanceerd","skills.intermediate":"Gevorderd","tags.all":"Alles"}